# 8.4_chislomensheposlednego

Напишите программу, выводящую на экран все элементы массива, которые меньше последнего.

Входные данные:
Первая строка число 
N
,
(
N
>
0
)
N,(N>0) -- длина массива. Длина массива -- не более 100 элементов. Вторая строка -- 
N
N  натуральных чисел, записанных через пробел

Выходные данные: 
Элементы массива, которые меньше его последнего элемента в том порядке, как они встречаются в массиве, через пробел, или же число 0, если таких элементов не существует.

#include <stdio.h>
#include <stdlib.h>
#include <math.h>
 
int main(){
    
    int n;
    int i;
    int array[100];
    int temp = -1;
 
    scanf("%d",&n);

    for (i=0; i<n; i++)
    {
        scanf("%d", &array[i]);
    }
  
    for (i=0; i<n; i++)
    {
      if (array[i] < array[n - 1]) 
      {
        temp = array[i];
        printf("%d ", temp);
      }
    }
    if (temp < 0 )
      printf("0");
  
  return 0;
   
}
